START_MESSAGES_RU = [
'Привет! Я Скилбадди – ваш репетитор английского языка, созданный на модели chatGPT. Пожалуйста, не стесняйтесь спрашивать меня о своих грамматике и произношении. Я помогу вам с практикой, или мы можем просто поговорить на английском.',
'Здравствуйте, я Скилбадди. Я ваш личный репетитор по английскому языку. Вы можете говорить, тренироваться и проверять свои грамматические навыки вместе со мной. Также я могу проверить ваше произношение и сказать, правильное ли оно. С чего начнём? ',
'Привет! Я Скилбадди. Я буду вашим личным носителем английского языка. Вы можете говорить со мной на любую тему. Давайте общаться и развлекаться! ',
'Рад познакомиться! Я Скилбадди - ваш репетитор по английскому языку, разработанный на основе модели chatGPT. Вы можете общаться со мной как с приятелем-носителем языка. Пожалуйста, скажите мне, что вы хотите обсудить, и желаете ли, чтобы я проверил ваши знания английского языка. ',
'Привет, как дела? Я Скилбадди, искусственный интеллект в роли носителя английского языка. Я  буду распознавать ваш устный и письменный английский и давать советы по грамматике и навыкам произношения. '
]