START_MESSAGES_RU = [
'Привет! Я Скилбадди – ваш репетитор английского языка, созданный на модели chatGPT. Пожалуйста, не стесняйтесь спрашивать меня о своих грамматике и произношении. Я помогу вам с практикой, или мы можем просто поговорить на английском. ',
'Здравствуйте, я Скилбадди. Я ваш личный репетитор по английскому языку. Вы можете говорить, тренироваться и проверять свои грамматические навыки вместе со мной. Также я могу проверить ваше произношение и сказать, правильное ли оно. С чего начнём?',
'Привет! Я Скилбадди. Я буду вашим личным носителем английского языка. Вы можете говорить со мной на любую тему. Давайте общаться и развлекаться!',
'Рад познакомиться! Я Скилбадди - ваш репетитор по английскому языку, разработанный на основе модели chatGPT. Вы можете общаться со мной как с приятелем-носителем языка. Пожалуйста, скажите мне, что вы хотите обсудить, и желаете ли, чтобы я проверил ваши знания английского языка.',
'Привет, как дела? Я Скилбадди, искусственный интеллект в роли носителя английского языка. Я  буду распознавать ваш устный и письменный английский и давать советы по грамматике и навыкам произношения. '
]


START_MESSAGES_EN = [
    "Hi there! I am Skillbuddy, your English tutor, built on chatGPT model. Please do not hesitate to ask me tips about grammar & pronunciation. I will help you with practice, or we can just talk in English!",
    "Hello, this is Skillbuddy. I am your personal tutor of English. You can speak, train and check your grammar skills with me. I can also check your pronunciation and tell you, if it is correct. Where do we start?",
    "Hi! I am Skillbuddy. I`ll be your personal English native speaker. You can speak with me on any topic. Let`s communicate and have fun!",
    "Nice to meet you! I`m Skillbuddy, your chatGPT-designed English tutor. You can chat with me as with a native speaker buddy. Please tell me, what you want to discuss and if you want me to check your English skills. ",
    "Hey, how are you? I am Skillbuddy, an Artificial Intelligence in the role of a native English speaker. I will recognize your verbal and written English and give advice on grammar & pronunciation skills."
]

HELP_MESSAGE_RU = '''
Вот команды, которые доступны в боте:
/grammar - переход в режим проверки грамматики
/menu - смена языка
/pronunciation - переход в режим проверки произношения
/reset - сброс контекста
/start - описание бота
/subscribe - купить подписку
/talk - переход в свободное общение
/voice - переход в режим голосовых сообщений
'''

HELP_MESSAGE_EN = '''
Here are the commands available in the bot:
/grammar - switch to grammar check mode
/menu - change language
/pronunciation - switch to pronunciation check mode
/reset - delete context 
/start - description of the bot
/subscribe - pay a subscription
/talk - switch to free conversation mode
/voice - switch to voice message mode
'''

def get_ref_link_text(n, url):
    return [f'Будущее уже здесь 🤙 Тренируй свой английский со Skillbuddy! Попробовать бесплатно: {url}',                                          
    f'Попробуй бесплатного ИИ-репетитора 🇬🇧, с которым изучение английского превращается в игру двух интеллектов: {url}',                                                                                                          
    f'Узнай много нового в интерактивном диалоге с chatGPT-на английском языке. Skillbuddy повысит твой скилл общения на English 💪 {url}',                                                                                      
    f'Skillbuddy (chatGPT) - тренер английского нового поколения, помогающий общаться на одном языке с 🤖 в удовольствие. Попробуй: {url}',                                                                                    
    f'Раскрой языковой потенциал нейросети chatGPT со Skillbuddy! Английский язык ещё никогда не был столь увлекательным 👍 {url}',                                                          
    f'Тренируй свой английский 🇬🇧, расширяй кругозор 🏝, развивай вербальный интеллект вместе со Skillbuddy 👧! Поговорить с репетитором на базе chatGPT бесплатно: {url}',
    f'Новый вербальный носитель 🇬🇧 - Skillbuddy. Твой лучший друг в тренировке навыков английского. Пробуй: {url}',
    f'Разговори свой English cо Skillbuddy! Попробуй поговорить с опытным носителем в непринужденной беседе ⛱: {url}',
    f'Не знаешь с кем поговорить на английском 🤷‍♀️? Как насчёт искусственного интеллекта? Прокачай свой English c chatGPT: {url}',
    f'Собираешься поехать за границу 😎? Потренируй свой английский со Skillbuddy, это бесплатно: {url}. Он использует 🇬🇧 на базе chatGPT и поможет освоиться в любой языковой среде🤙'][n]